public class MyArrayList {
//    1) Создайте ArrayList, заполните его 100 случайными значениями, используя библиотеку Random
//    Решите две задачи и пришлите решение ссылкой на гитхаб
//
//    1) Выведите все элементы списка, которые больше предыдущего элемента этого же списка.
//    Пример, если список выглядит так - 1 5 2 4 3
//    То мы выведем - 5 4
//
//    2) Выведите значение наименьшего из всех положительных элементов в списке
//
//    Пример, если список выглядит так - 5 -4 3 -2 1
//    То мы выведем - 1

    private int[]array;
    public MyArrayList(){
        array= new int[10];
    }

}
